{
  "navbar": {
    "home": "Home Page",
    "skills": "Skills",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "about": {
    "personal_title": "About me",
    "personal_text": "Hi, my name is Jacob. I am from Poland, more specifically from the vicinity of the city of Gdańsk, where I also studied computer science. I am a naturally friendly person who can talk about everything and nothing. I started my programming journey with web development, and currently, I write complex full-stack applications.",
    "experience_title": "Professional life",
    "experience_text": "I started my first job in the profession iun April 2022 as a full-stack developer. I learned many interesting things there, such as software containerization, a bit of Kubernetes, and above all, teamwork. I also got to know new frontend frameworks lie Vue.js, Angular, as well backend frameworks like Flask and FastAPI.",
    "student_title": "Student's life",
    "student_text": "I am a graduate of the Computer Science program with a specialization in \"Artificial Intelligence\" at the Polish-Japanese Academy of Information Technology in Gdańsk.\n\nDuring my studies, I developed an engineering project called \"Flash-Cards\", which is available on my student GitHub profile. The project mainly focused on generating flashcards using artificial intelligence. I was responsible for developing the backend with FastAPI and the mobile application using React Native.",
    "hobby_title": "Hobby",
    "hobby_text": "I ❤️",
    "hobby_text_music": "My favorite music genders are pop and dance/electronic. For relaxation, I also enjoy listening to jazz",
    "hobby_text_programming": "I've been interested in programming for several years now, mainly because I can create something without the need for various physical materials, only relying on knowledge and skills. I especially love creating user-friendly interfaces with interesting animations.",
    "hobby_text_ai": "I don't have much experience with artificial intelligence in terms of coding. I acquired my current knowledge during my studies, where I learned artificial intelligence search patterns and scikit-learn algorithms.In my free time, I try to continue my course on artificial intelligence. What sparked my interest? I believe that artificial intelligence has the potential to accelerate certain processes or make them easier for us, such as information retrieval. And as we know, everyone likes it when it's easier.",
    "hobby_text_cooking": "My interest in cooking arose by chance. When I was looking for a break from programming to relax a bit, I thought that maybe cooking could help me with that. I enjoy eating everything, but I particularly favor Asian and Italian cuisine.",
    "hobby_text_draw": "I don't draw myself, but I love admiring the talent and skills of others. That's why I often look for new wallpapers for my computer, browsing through various art galleries and collections."
  },
  "links": {
    "private_github": "Private Github",
    "student_github": "Student GitHub"
  },
  "skills": {
    "frontend": "I have experience with JavaScript frameworks and libraries such as React, Next.js, and Vue.js. In my daily work, I primarily use Vue. I also have hands-on experience with TypeScript, which I regularly use in my projects.",
    "backend": "I mainly work with Python, appreciating its powerful capabilities and versatility. I have experience with backend frameworks such as Django, FastAPI, and Flask.\n\nFor data-related tasks, I frequently use libraries like Pandas and NumPy, which greatly simplify reading, processing, and analyzing data from Excel, CSV, and other sources.",
    "docker": "I mainly use Docker for containerizing applications and databases. Currently, I am expanding my knowledge of Kubernetes to better manage containers in production environments.",
    "database_title": "Databases",
    "database_text": "I have solid experience with both SQL and NoSQL databases, including Cassandra and MongoDB. In my work, I primarily deal with SQL databases, which has allowed me to become proficient with tools like SQLAlchemy.",
    "systems_title": "Operating Systems",
    "systems_text": "I spend most of my time working with UNIX-based systems, mainly MacOS and Linux Mint. Privately, I also use Windows 11 with WSL. I have a strong foundation in working with system tools, configuring environments, and using the Bash shell.",
    "git": "I use Git daily for version control and team collaboration. I'm familiar with common workflows like GitFlow and work comfortably with platforms such as GitHub and GitLab."
  },
  "contact": {
    "contact_me": "Contact me",
    "email": "Email",
    "likedin": "Likedin"
  },
  "languages": {
    "change_language": "Change language",
    "english": "English",
    "polish": "Polish"
  },
  "portfolio": {
    "chat_app_title": "Chat app",
    "chat_app_text": "The app is modeled on one of the most popular chat application, Discord",
    "dc_bot_title": "Voice assistant",
    "dc_bot_text": "The voice assistant was created with the intention of making it easier to execute basic commands on Discord using voice.",
    "developing": "The project is currently under development. After the release of the test version, a link will be provided."
  },
  "standards": {
    "not_found": "Page not found",
    "return_to_home": "Go to the home page",
    "rights_reserved": "All rights reserved",
    "or": "or"
  }
}