{
  "navbar": {
    "home": "Strona Główna",
    "skills": "Umiejętności",
    "portfolio": "Portfolio",
    "contact": "Kontakt"
  },
  "about": {
    "personal_title": "O mnie",
    "personal_text": "Cześć, nazywam się Jakub. Pochodzę z Polski, a dokładniej z okolic miasta Gdańsk, gdzie studiowałem informatykę. Jestem osobą z natury przyjazną, która potrafi rozmawiać o wszystkich i o niczym. Swoja przygodę z programowaniem zacząłem od pisania stron internetowych, a obecnie piszę rozbudowane aplikacje full stackowe.",
    "experience_title": "Życie zawodowe",
    "experience_text": "Swoją pierwszą pracę w zawodzie rozpocząłem w kwietniu 2022 jako full stack developer. Nauczyłem się tam wielu ciekawych rzeczy jak na przykład konteneryzacja oprogramowania, troszke Kubernetesa czy przede wszystkim pracy zespołowej. Poznałem również nowe frameworki frontendowe takie jak Vue.js, Angular, czy backendowe jak Flask czy FastAPI.",
    "student_title": "Życie studenckie",
    "student_text": "Jestem absolwentem kierunku informatycznego o specjalizacji „Sztuczna Inteligencja” na Polsko-Japońskiej Akademii Technik Komputerowych w Gdańsku.",
    "hobby_title": "Hobby",
    "hobby_text": "Lubię ❤️",
    "hobby_text_music": "Moim ulubionym gatunkiem muzycznym są pop i dance/electronik. Dla relaksu lubię też sluchać jazzu",
    "hobby_text_programming": "Programowaniem interesuję się już od kilku lat, głownie dlatego, że mogę stworzyć coś i nie potrzebuję do tego różnych fizycznych materiałów, a jedynie wiedzy i umiejętności. Najbardziej uwielbiam tworzyć przejrzyste interfejsy użytkownika z ciekawymi animacjami.",
    "hobby_text_ai": "Nie posiadam zbyt dużego doświadczenia ze sztuczna inteligencja na tle kodu. Swoja aktualną wiedzę nabyłem na studiach gdzie poznałem schematy wyszukiwania sztucznej inteligencji, oraz algorytmy scikit-learn. W wolnej chwili staram się kontynuować kurs na temat sztucznej inteligencji. Skąd zainteresowanie? Uważam, że sztuczna inteligencja jest w stanie przyspieszyć niektóre procesy lub ułatwić nam ich wykonywanie, jak na przykład wyszukiwanie informacji. A jak wiemy każdy lubi jak jest lżej.",
    "hobby_text_cooking": "Zainteresowanie gotowaniem pojawiło się przypadkiem. Gdy szukałem odskoczni od programowania, żeby się trochę zrelaksować, stwierdziłem, że może gotowanie mi w tym pomoże. Lubię jeść wszystko, jednakże głównie gustuje w kuchni azjatyckiej oraz włoskiej.",
    "hobby_text_draw": "Sam nie rysuję, ale uwielbiam podziwiać talent i umiejętności innych. Z tego powodu często szukam nowych tapet na komputer, przeglądając różne galerie i kolekcje artystyczne."
  },
  "links": {
    "private_github": "Prywatny Github",
    "student_github": "Studencki GitHub"
  },
  "skills": {
    "frontend": "Znam takie frameworki i biblioteki JavaScript jak React, Next.js oraz Vue.js. Na co dzień w pracy głównie wykorzystuję Vue. Posiadam także doświadczenie w pracy z TypeScriptem, którego regularnie używam w projektach.",
    "backend": "Głównie korzystam z Pythona, doceniając jego potężne możliwości i wszechstronność. Mam doświadczenie w pracy z backendowymi frameworkami takimi jak Django, FastAPI oraz Flask.\n\nW pracy z danymi często wykorzystuję biblioteki takie jak Pandas i NumPy, które znacząco ułatwiają odczytywanie, przetwarzanie i analizę danych z plików Excel, CSV oraz innych źródeł.",
    "docker": "Docker wykorzystuję głównie do konteneryzacji aplikacji oraz baz danych. Obecnie poszerzam swoją wiedzę w zakresie Kubernetes, aby lepiej zarządzać kontenerami w środowiskach produkcyjnych.",
    "database_title": "Bazy danych",
    "database_text": "Mam dobre doświadczenie zarówno z bazami SQL, jak i NoSQL, takimi jak Cassandra czy MongoDB. W pracy najczęściej korzystam z baz SQL, co pozwoliło mi lepiej poznać narzędzia takie jak SQLAlchemy.",
    "systems_title": "Systemy",
    "systems_text": "Większość czasu pracuję na systemach UNIX-owych, głównie na MacOS oraz Linux Mint. Prywatnie korzystam także z Windows 11 wraz z WSL. Posiadam solidną wiedzę z zakresu obsługi narzędzi systemowych, konfiguracji środowisk oraz pracy z powłoką Bash.",
    "git": "Na co dzień korzystam z Gita do kontroli wersji i zarządzania kodem w projektach zespołowych. Znam dobrze popularne workflowy, takie jak GitFlow, i swobodnie pracuję z platformami takimi jak GitHub czy GitLab."
  },
  "contact": {
    "contact_me": "Skontaktuj się ze mną",
    "email": "Email",
    "likedin": "Likedin"
  },
  "languages": {
    "change_language": "Zmień język",
    "english": "Angielski",
    "polish": "Polski"
  },
  "portfolio": {
    "chat_app_title": "Aplikacja do rozmów",
    "chat_app_text": "Aplikacja jest wzorowana na jednej z najpopularniejszych aplikacji do rozmów, Discord.",
    "dc_bot_title": "Asystent głosowy",
    "dc_bot_text": "Asystent glosowy powstał z myślą o ułatwieniu wykonywania podstawowych komend na Discordzie za pomocą głosu.",
    "developing": "Projekt jest obecnie w trakcie tworzenia. Po wypuszczeniu wersji testowej, udostępniony zostanie link."
  },
  "standards": {
    "not_found": "Nie znaleziono strony",
    "return_to_home": "Powrót na strone główną",
    "rights_reserved": "Wszelkie prawa zastrzeżone",
    "or": "lub"
  }
}